{
    "pageTitle": "Research and Industrial Experiences",
    "experiences": [
        {
            "title": "Research Experience",
            "content" : [
                {   
                    "title": [
                        "Yonsei University",
                        "Master's Student Researcher",
                        "Aug 2023-Present"
                    ],
                    "content": [
                        {
                            "body": "At Yonsei University, I am working on designing spectrum-sharing systems and digital twin systems for 6G networks with Generative AI. Additionally, I am contributing to 6G-Arrow, Europe-Korea collaborative project, focusing on the development of AI-native integrated RAN- CORE networks for 6G."
                        }
                    ]
                }
            ]
        },
        {
            "title": "Industrial Experience",
            "content" : [
                {   
                    "title": [
                        "PickMe (Digital Mobility Solutions Pvt Ltd)",
                        "Software Engineer (Research and Development)",
                        "Apr 2021 - Aug 2022"
                    ],
                    "content": [
                        {
                            "title": "Organization’s Activities",
                            "body": "PickMe is a digital mobility solutions provider in Sri Lanka. It is a subsidiary of Digital Mobility Solutions Netherlands B.V. The company provides a range of services, including taxi-hailing, delivery, and logistics services. PickMe has a customer base of over 5 million users and a driver base of over 100,000 drivers."
                        },
                        {
                            "title": "My Tasks",
                            "body": "I worked on the development of the PickMe Driver app, which is used by drivers to accept and complete rides. I was involved in the development of the driver app’s UI, the driver app’s backend, and the driver app’s integration with the PickMe backend. The technologies and platforms used were React Native, JavaScript, GoLang, Python and MySQL."
                        },
                        {
                            "body": "I was also involved in the development of a new driver registration system through the PickMe driver's app using GoLang and MySQL."
                        }
                    ]
                },
                {   
                    "title": [
                        "VS Information Systems (Pvt) Ltd",
                        "Software Engineer - Intern",
                        "Jun 2019 - Dec 2019"
                    ],
                    "content": [
                        {
                            "title": "Organization’s Activities",
                            "body": "VS Information Systems is a ICT solutions provider in Sri Lanka. The company provides a range of services, including Enterprise Systems, Virtualization and Cloud, Enterprise Data and Applications, Cybersecurity, Digital Telco, ELV and Enterprise Networks, and Personal Systems"
                        },
                        {
                            "title": "My Tasks",
                            "body": "I worked on introducing robotic process automated ticketing system for the company's help-desk system for the Enterprise and cloud system clients using UiPath."
                        },
                        {
                            "body": "I was also involved in introducing Jira software and software management process under agile practices for the company's software development team."
                        }
                    ]
                }
            ]
        }

    ]
}