{
    "pageTitle": "About Me",
    "content": {
        "firstPara": [
            {
                "key": "me-1",
                "body": "Hello everyone! I'm a Master's student at the Yonsei University working on using Generative Artificial Intelligence for wireless networks, supervised by Prof. Kim Seoung-Lyun. In a broader sense, I am interested in research in the areas of Artificial Intelligence, Wireless networks and Machine Learning."
            }
        ],
        "contentDetails": [
            {
                "title": "Education",
                "content": [
                    {
                        "title": [
                            "School of Electrical and Electronic Engineering , Yonsei University, South Korea",
                            "Master of the Science of Engineering, Specialization: Electrical & Electronic Engineering",
                            "Aug 2023 - Present (Expected Graduation: Aug 2025)"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    },
                    {
                        "title": [
                            "Department of Electronics and Telecommunication  Engineering, Faculty of Engineering, University of Moratuwa, Sri Lanka",
                            "Bachelor of the Science of Engineering (Hons), Specialization: Electronics and Telecommunication Engineering",
                            "Aug 2016 - Apr 2021"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    },
                    {
                        "title": [
                            "Primary and Secondary Education",
                            "Southlands College, Galle, Sri Lanka",
                            "2001-2015"
                        ],
                        "content": [
                            {
                                "body": []
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Misc",
                "content": [
                    {
                        "title": [ "Languages" ],
                        
                        "content": [
                            {
                                "body": [
                                    {
                                        "body":[
                                            " I first started reading books in English when I was 11 years old. My motivation was to challenge myself and enjoy stories in their original language. Since then, I have been reading books, watching movies and listening to music in English and have become quite fluent in it. I have also been learning Korean since moving to South Korea in 2022. Here is a list of languages I can speak and understand to a certain extent."
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Sinhala - Native"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "English - Fluent [TOEFL iBT 105/120 with a writing score of 27/30]" 
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Korean - Intermediate [TOPIK Level 4]"
                                        ]
                                    }
                                ]
                            }                   
                        ]
                    },
                    {
                        "title": [
                            "Table Tennis"
                        ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "I’ve always loved sports, but the only one I pursued seriously was Table Tennis. I started playing when I was 6 years old and played competitively for many years, even representing my university in Sri Lanka. Although there were moments when I lost my passion for the game, my parents’ encouragement kept me going. Unfortunately, I haven’t played for the last two years due to a knee injury I sustained while competing for my university. However, I have started going to the gym regularly to strengthen my knee and to compensate for the lack of physical activity.  In case you are interested, here is a boring list of my Table Tennis achievements."
                                        ]
                                    }
                                ]
                            },
                           
                            {
                                "title": "Representing the Table Tennis team of the University of Moratuwa",
                                "body": [
                                    {
                                        "body": [
                                            "2019 - Sri Lanka University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2019 - SIEG Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Inter University Games - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Mora Smashes Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2018 - KDU Leaders' Trophy Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2017 -  University of Moratuwa Colors Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2017 - Wayo Spins Inter University tournament - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2017 - KDU Leaders' Trophy Inter University tournament - Champion"
                                        ]
                                    }

                                ]
                            },
                            {
                                "title": "Representing the Table Tennis team of Southland College",
                                "body": [
                                    {
                                        "body": [
                                            "2013 - All Island School Games - Silver Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island Inter-School Under 19 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2012 - All Island Inter-School Under 18 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2011-  All Island School Games - Bronze Medal"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2011 - All Island Inter-School Under 16 Girls B-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2010 - All Island Inter-School Under 14 Girls B-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2010 - All Island Inter-School Under 18 Girls C-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2009 - All Island Inter-School Under 12 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2009 - All Island Inter-School Under 16 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2008 - All Island Inter-School Under 12 Girls C-Division - Champion"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2007 - Sri Lanka Table Tennis Colors - Merit Award"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2005 - All Island Inter-School Under 10 Girls A-Division - Runner-Up"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "2004 - All Island Inter-School Under 10 Girls B-Division - Runner-Up"
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "title": [ "Other hobbies" ],
                        "content": [
                            {
                                "body": [
                                    {
                                        "body": [
                                            "Books, music, and movies have always been a big influence on me. Though I enjoy exploring various genres—ranging from the fantasy epic The Name of the Wind by Patrick Rothfuss to the thought-provoking Sapiens: A Brief History of Humankind by Yuval Noah Harari—I have a soft spot for fantasy. My love for the genre began with Harry Potter as a child, and it has only grown over time. In addition to reading, I’m also a fan of sci-fi movies and dramas like The Expanse and Black Mirror. Since moving to South Korea, I’ve discovered K-dramas and K-pop, which have not only been a source of entertainment but have also helped me improve my Korean language skills.It is always hard to list out favorites, but just because I want to list out something in this section, here’s a list of some quotes that I find compelling, mostly taken from books and k-dramas."
                                        ]
                                    }
                                ]
                            },
                            {
                                "body": [
                                    {
                                        "body": [
                                            "The purpose of a storyteller is not to tell you how to think, but to give you questions to think upon. - Brandon Sanderson, “The Way of Kings”"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "It is our choices that show who we truly are, far more than our abilities.” – Albus Dumbledore, “Harry Potter”"                                        ]
                                    },
                                    {
                                        "body": [
                                            "I don't know where I'm trapped, but I want to break free. I want to feel truly happy, truly good. And I want to be able to say, 'Ah, this is life. This is what it means to be alive.' - Kim Ji-Won, “My Liberation Notes”"

                                        ]
                                    },
                                    {
                                        "body": [
                                            "Life isn't so fair for all of us. Some spend their whole lives walking unpaved roads, while some run full speed just to hit a cliff and fall. - Hong Du-sik, “Hometown Cha Cha Cha”"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "We can know only that we know nothing. And that is the highest degree of human wisdom. - Pierre Bezukhov (War and Peace - Leo Tolstoy) (sometimes called the Socratic paradox)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Often we pass beside happiness without seeing it, without looking at it, or even if we have seen and looked at it, without recognizing it. - Sinbad the sailor (The Count of Monte Cristo - Alexandre Dumas)"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "Fairy tales are more than true not because they tell us that dragons exist, but because they tell us that dragons can be beaten. -Neil Gaiman"
                                        ]
                                    },
                                    {
                                        "body": [
                                            "“I wish it need not have happened in my time,” said Frodo. “So do I,” said Gandalf, “and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the time that is given us.” -“The Fellowship of the Ring” , J. R. R. Tolkien"
                                        ]
                                    },                                  {
                                        "body": [
                                            "Nothing lasts forever. You only live once. So live your life, not any other life. Take chances and never regret. -  BTS, “Intro : O!RUL8,2?”"
                                        ]
                                    }

                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    }
}
