{
    "publication": {
        "pageTitle": "Publications",
        "publications": [
            {
                "title": "Amanda Sheron Gamage, Kim Seong-Lyun . ' A Spectrum Sharing System: A Comparison of DDPMs and GANs for Visualized Interference Classification with CNN '. Accepted at the International Conference on Information and Communication Technology Convergence (ICTC). 2024"
                

               
            },
            {
                "title": "Amanda Sheron Gamage, Riku Jäntti and Kim Seong-Lyun. ' Deep Learning for Spectrum Sharing: Leveraging Generative Models to Classify CBRS Collision Scenarios.' Submitted to the IEEE International Symposium on Dynamic Spectrum Access Networks (DySPAN). 2025"
                
            }

        ]
    },
    
    "research": {
        "pageTitle": "Research Projects",
        "projects": [
            {
                "name": "Generative Models for Digital Twins of Wireless Networks",
                "duration": "2024 Dec - present",
                "place": "Yonsei University, South Korea",
                "content": [
                    {
                        "body": "In this research, we are currently studying on using data augmentation methods using Generative Models like LLMs for Digital Twins of 6G networks under the supervision of Prof. Kim Seong-Lyun."
                    }
                ]
            },
            {
                "name": "A Spectrum-sharing System using Generative Models",
                "duration": "2024 Feb - 2024 Dec",
                "place": "Yonsei University, South Korea",
                "content": [
                    {
                        "body": " In this research we developed a novel deep-learning based collision detection spectrum-sharing system for the Citizens Broadband Radio Service (CBRS) spectrum leveraging generative models and the evaluated the performance of three types of generative models, namely, Denoising Diffusion Probabilistic Models (DDPMs), Generative Adversarial Networks (GANs), and Vector Quantized Variational Autoencoders (VAEs) for the task of visualized interference classification. This project was done in collaboration with Prof. Riku Jäntti and Prof. Kim Seong-Lyun."
                    }
                ]
            },
            {
                "name": "Seismic Sensor Network for Remote Detection of Wild Elephants ",
                "duration": "2020  - 2021",
                "place": "University of Moratuwa, Sri Lanka",
                "content": [
                    {
                        "body": "This study aims to propose an approach to detect seismic signals generated by rumbles and footfalls of elephants using machine learning, IoT and signal processing concepts. This project was supervised by Prof. Rohan Munasinghe and Prof. Chamira Edussooriya"
                    }
                ]
            }
        ]
    }
}
